app/views/friends/index.html.erb

    <%= image_tag friend['picture']['data']['url'] %>
    <%= link_to friend['first_name'] + " " + friend['last_name'],
				{:controller => "goal_instances", :user_id => User.find_by_fb_id(friend['id']).id},
        {:class => "label label-default"} %>
---
SELECT `users`.* FROM `users` WHERE `users`.`fb_id` = '100002338165006' LIMIT 1