app/controllers/friends_controller.rb

  def index
  	current_user = User.find(session[:current_user])
  	@api = Koala::Facebook::API.new(session[:access_token])
  	current_user_friends = @api.get_object("/" + current_user.fb_id + "/", "fields"=>["friends"])

    @current_user_friends_in_trackr = []
    current_user_friend_ids = []

    current_user_friends['friends']['data'].each { |friend|
      # puts friend['id'].to_s
      current_user_friend_ids.push(friend['id']);
    }
    @current_user_friends_in_trackr = User.find_all_by_fb_id(current_user_friend_ids)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 9 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`fb_id` = '502961332' LIMIT 1