app/controllers/goals_controller.rb

  def index
    #@goals = Goal.all
    if(params[:search])
      search = params[:search]
      #cache ["goals",@goals] do
      @goals = Goal.paginate(:page => params[:page],
                              :per_page => 12,
                              :conditions => ['title like ?',
                              "%#{search}%"],
                              :order => 'title')
---
SELECT COUNT(*) FROM `goals`
SELECT `goals`.* FROM `goals` LIMIT 10 OFFSET 0

  def show
    @current_user = User.find(session[:current_user])
    @goal = Goal.find(params[:id])
    @api = Koala::Facebook::API.new(session[:access_token])
    @is_current_user_joined = false
    cache ["goal",@goal] do
      _current_follower_ids=[]
      @current_followers = []
      _time1 = Time.now
      @goal.goal_instances.each { |goal_instance|
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 5 LIMIT 1
SELECT `goals`.* FROM `goals` WHERE `goals`.`id` = 4 LIMIT 1
SELECT `goal_instances`.* FROM `goal_instances` WHERE `goal_instances`.`goal_id` = 4

  def edit
    @goal = Goal.find(params[:id])
---
SELECT `goals`.* FROM `goals` WHERE `goals`.`id` = 1 LIMIT 1

  def create
    @goal = Goal.new(params[:goal])
    current_user = User.find(session[:current_user])
    current_user.goals.push(@goal)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 43 LIMIT 1
INSERT INTO `goals` (`created_at`, `description`, `picture_content_type`, `picture_file_name`, `picture_file_size`, `picture_updated_at`, `title`, `updated_at`, `user_id`) VALUES ('2013-11-08 02:06:29', 'aljd', NULL, NULL, NULL, NULL, 'someh', '2013-11-08 02:06:29', 43)

  def destroy
    @goal = Goal.find(params[:id])
      respond_to do |format|
        if !@goal.destroy
---
SELECT `goals`.* FROM `goals` WHERE `goals`.`id` = 34 LIMIT 1
DELETE FROM `goals` WHERE `goals`.`id` = 34