app/controllers/goal_instances_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 24 LIMIT 1
SELECT `goal_instances`.* FROM `goal_instances` WHERE `goal_instances`.`user_id` = 24
---
  def index
    puts 'params[:user_id] = ' + params[:user_id].inspect
    if params[:user_id] == nil
      current_user = User.find(session[:current_user])
    else
      current_user = User.find(params[:user_id])
    end

    @goal_instances = current_user.goal_instances
    @goal_instances = @goal_instances.paginate(:page => params[:page], :per_page => 5)

SELECT `goal_instances`.* FROM `goal_instances` WHERE `goal_instances`.`id` = 17 LIMIT 1
SELECT `goals`.* FROM `goals` WHERE `goals`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def show

    @goal_instance = GoalInstance.find(params[:id])
    @is_current_user_joined = false
    goal_ins = GoalInstance.where('user_id = :uid and goal_id = :gid',
                  {uid: session[:current_user], gid: @goal_instance.goal.id})

SELECT `goal_instances`.* FROM `goal_instances` WHERE `goal_instances`.`id` = 17 LIMIT 1
---
  def edit
    @goal_instance = GoalInstance.find(params[:id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
INSERT INTO `goal_instances` (`cheer_ons`, `created_at`, `end_date`, `goal_id`, `is_complete`, `start_date`, `updated_at`, `user_id`) VALUES (NULL, '2013-11-06 07:55:29', '2013-11-06', NULL, NULL, '2013-11-06', '2013-11-06 07:55:29', 1)
---
  def create
    puts params.to_s()
    @goal_instance = GoalInstance.new(params[:goal_instance])
    current_user = User.find(session[:current_user])
    current_user.goal_instances.push(@goal_instance)