app/controllers/login_controller.rb

  def callback
     #handle error callback
    @error_message= nil
    if params[:error_code].eql? "200"
      @error_message = "You have denied the permissions to access the Trac.kr App." +
                          " Please allow it, in order to continue"
    end
    if params[:code]
      session[:access_token] = session[:oauth].get_access_token(params[:code])
      puts session[:access_token]
      @api = Koala::Facebook::API.new(session[:access_token])
      begin
        user_data = @api.get_object("/me/?fields=first_name,last_name,username,id,picture")
          # "fields"=>["first_name","last_name","username", "id"])
        existing_user = User.find_by_fb_id(user_data["id"])

        if existing_user
          if existing_user.first_name != user_data["first_name"] or existing_user.last_name != user_data["last_name"]

            existing_user.update(first_name: user_data["first_name"], last_name: user_data["last_name"]);

          end

          session[:current_user] = existing_user.id
          session[:current_user_first_name] = existing_user.first_name
          session[:current_user_last_name] = existing_user.last_name
          session[:current_user_fb_id] = existing_user.fb_id

        else not existing_user
          new_user = User.create(
            first_name: user_data["first_name"],
            last_name: user_data["last_name"],
            fb_id: user_data["id"]
          );
---
SELECT `users`.* FROM `users` WHERE `users`.`fb_id` = 'dibyendu.nath' LIMIT 1
INSERT INTO `users` (`created_at`, `fb_id`, `first_name`, `last_name`, `updated_at`) VALUES ('2013-11-04 23:00:53', 'dibyendu.nath', 'Dibyendu', 'Nath', '2013-11-04 23:00:53')