app/views/goals/index.html.erb

		  	<div class="caption" style="text-align: center">
		  		<h4><%= link_to goal.title , goal%><span class="badge"><%= goal.goal_instances.length%></span></h4>
---
SELECT COUNT(*) FROM `goals`
SELECT `goal_instances`.* FROM `goal_instances` WHERE `goal_instances`.`goal_id` = 4
SELECT `goals`.* FROM `goals`

  <tr>
  	<td><%if goal.user then%><%= goal.user.first_name+" "+ goal.user.last_name%> <%end%></td>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 5 LIMIT 1