app/views/goals/show.html.erb

				Created by
				<%= link_to @goal.user.first_name + " " + @goal.user.last_name,
						{:controller => "goal_instances", :user_id => @goal.user.id}
---
SELECT `goal_instances`.* FROM `goal_instances` WHERE `goal_instances`.`goal_id` = 4
SELECT `users`.* FROM `users` WHERE `users`.`id` = 5 LIMIT 1