app/views/goal_instances/index.html.erb

<% if session['current_user'].to_s != params[:user_id].to_s %>
  <h2><%= "Goals pursued by " + User.find(params[:user_id]).first_name + " " + User.find(params[:user_id]).last_name%></h2>
---
SELECT `goals`.* FROM `goals` WHERE `goals`.`id` = 16 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 24 LIMIT 1