app/views/goal_instances/show.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
				<div class="col-sm-5"> <b>
					<% if User.find(session[:current_user]) == @goal_instance.user then %>